## Pandas

In [103]:
#Pandas is built on top of Numpy
#Numpy is faste, but Pandas has added features
#added features include
#data ceansing, filtering , groupby, merge/concatenante

#Pandas hae two data structures
#series - one dimensional data/ one feature
#dataframe - multidimension data/ more than one features

#How to create a series

#create a series using a list
import pandas as pd
import numpy as np

a = [0.25,0.5,0.75,1.0]

data_pd = pd.Series(a)

In [104]:
data_pd

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [105]:
#2. Create a series using a numpy array
numpy_arr = np.array(a)
data_pd = pd.Series(numpy_arr)
data_pd

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [106]:
#access index
#so this index can be iterated
type(data_pd.index)

pandas.core.indexes.range.RangeIndex

In [107]:
for i in data_pd.index:
    print(i)

0
1
2
3

In [108]:
#access the values 
data_pd.values

array([0.25, 0.5 , 0.75, 1.  ])

In [109]:
type(data_pd.values) # each value is numpy. Check type! its numpy, so we can do exact same thing as what we can do with numpy

numpy.ndarray

In [110]:
#indexing
#indexing in Pandas is very simlilar to Numpy
#BUT there is one confusing part - implicit index vs explicit index

data_pd

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [111]:
#indexing in series
data_pd[1] #single digit: explicit index 
data_pd[-2:] #slicing => implicit index

# data_pd[-1] #important observation #single digit => explicit index => does not exist
data_pd[-1:]

3    1.0
dtype: float64

In [112]:
#String indexing and Integer indexing are different

#indexing using strings
data_pd = pd.Series(numpy_arr,index=['a','b','c',2])

data_pd

a    0.25
b    0.50
c    0.75
2    1.00
dtype: float64

In [113]:
#access key a
data_pd['a']

0.25

In [114]:
data_pd[2] #using explicit index

1.0

In [115]:
data_pd[1:3] #using inplicit index

b    0.50
c    0.75
dtype: float64

In [116]:
data_pd = pd.Series(numpy_arr,index=['a','b','c','d'])
data_pd

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [117]:
data_pd[-1] #you can perform [-1], when you chave string indexing! all of them as str!!

1.0

In [118]:
#1. create Series from list
#2. create Series from numpy array
#3. create Series from dictionary

dict_ = {'Chiangrai' :111,
        'Pathum Thani': 222,
        'Bangkok': 333,
        'Chiangmai':444}
data_pd = pd.Series(dict_)
data_pd #key => index; value => values

Chiangrai       111
Pathum Thani    222
Bangkok         333
Chiangmai       444
dtype: int64

In [119]:
data_pd.index
#object means != not int, str = obj or seq of characters

Index(['Chiangrai', 'Pathum Thani', 'Bangkok', 'Chiangmai'], dtype='object')

In [120]:
data_pd

Chiangrai       111
Pathum Thani    222
Bangkok         333
Chiangmai       444
dtype: int64

In [121]:
#slice based on your string indexing
data_pd['Chiangrai':'Bangkok'] #INCLUDE BANGKOK

Chiangrai       111
Pathum Thani    222
Bangkok         333
dtype: int64

In [122]:
#4. create a series from a scalar
data_pd = pd.Series(5,index = [2,3,8])
data_pd

2    5
3    5
8    5
dtype: int64

In [123]:
data_pd = pd.Series([3,6,9],index = [2,3,8])
data_pd[2] #explicit index

3

In [124]:
data_pd

2    3
3    6
8    9
dtype: int64

In [125]:
data_pd[2:3] #inplicit index just like numpy

8    9
dtype: int64

In [126]:
#create list from tuple !

In [127]:
#DataFrame

#1. create dataframe using two dictionaries
#key of the dictionary => index
#values of the dictionary => values
#dictionary => columns

#[] list; ,
#() tuples; ,
#{} dictionary; , k:v key:value; keys and values can be anytypes

pop_dict = {'Chiangrai':111,
           'Pathum Thani': 222,
           'Bangkok':333,
           'Chiangmai':444}

area_dict = {'Chiangrai':2,
           'Pathum Thani': 3,
           'Bangkok':4,
           'Chiangmai':5}

states = pd.DataFrame({'population': pop_dict,
                      'area': area_dict})
states

              population  area
Chiangrai            111     2
Pathum Thani         222     3
Bangkok              333     4
Chiangmai            444     5

In [128]:
for i in states.index:
    print(i)

Chiangrai
Pathum Thani
Bangkok
Chiangmai

In [129]:
type(states.index)

pandas.core.indexes.base.Index

In [130]:
states.values

array([[111,   2],
       [222,   3],
       [333,   4],
       [444,   5]])

In [131]:
type(states.values)

numpy.ndarray

In [132]:
#Changes in pd.values (type numpy) 
#will reflect the changes in the pandas dataframe/series itself
states.values[0,0] = 99
states

              population  area
Chiangrai             99     2
Pathum Thani         222     3
Bangkok              333     4
Chiangmai            444     5

In [133]:
states ['Chiangrai':'Chiangmai'] 
#everything including chiangmai (the stop parameters)
#explicit indexing
#slicing uses implicit index
#but we are using explicit indexing

              population  area
Chiangrai             99     2
Pathum Thani         222     3
Bangkok              333     4
Chiangmai            444     5

In [134]:
states['Chiangrai': 'Chiangmai']['population']

Chiangrai        99
Pathum Thani    222
Bangkok         333
Chiangmai       444
Name: population, dtype: int64

In [135]:
type(states['Chiangrai': 'Chiangmai']['population'])

pandas.core.series.Series

In [136]:
states['population']['Chiangrai': 'Chiangmai']
#any orders are ok

Chiangrai        99
Pathum Thani    222
Bangkok         333
Chiangmai       444
Name: population, dtype: int64

In [137]:
states

              population  area
Chiangrai             99     2
Pathum Thani         222     3
Bangkok              333     4
Chiangmai            444     5

In [138]:
#indexing in dataFrame access columns!!!!!!
#states['Chiangrai'] DOES NOT WORK
# if we want to do that we have to use slicing
states['Chiangrai':'Bangkok']

              population  area
Chiangrai             99     2
Pathum Thani         222     3
Bangkok              333     4

In [139]:
states.index #pd.index objects behave vey much like numpy array

Index(['Chiangrai', 'Pathum Thani', 'Bangkok', 'Chiangmai'], dtype='object')

In [140]:
states.index[-1]

'Chiangmai'

In [141]:
#numpy only o=as implicit indexing
states.index[1:3] #can be looped!

Index(['Pathum Thani', 'Bangkok'], dtype='object')

In [142]:
states.columns #can be looped! same type!

Index(['population', 'area'], dtype='object')

In [143]:
type(states.columns) #can be looped

pandas.core.indexes.base.Index

In [144]:
#type
#help

In [145]:
#1. Create DataFrame from two dictionaries
#2. Create DataFrame from series

pop_series = pd.Series(pop_dict)
pd_from_series= pd.DataFrame(pop_series, columns = ['pop'])

In [146]:
pd_from_series

              pop
Chiangrai     111
Pathum Thani  222
Bangkok       333
Chiangmai     444

In [147]:
#3. create DataFrame from list of dicts ** different from the top
data = [{'a':i ,'b':2 *i} for i in range(3)]
pd_from_list_dict = pd.DataFrame(data, index = [3,6,9])
pd_from_list_dict

   a  b
3  0  0
6  1  2
9  2  4

In [148]:
#4. Create DataFrame from 2D numpy array
twod_numpy = np.random.rand(3,2)
twod_numpy

array([[0.68761119, 0.77041417],
       [0.30682004, 0.63281184],
       [0.07526721, 0.78807231]])

In [149]:
index = ['a','b','c']
columns = ['foo','boo']
pd_from_numpy = pd.DataFrame (twod_numpy,index = index, columns=columns)
pd_from_numpy

        foo       boo
a  0.687611  0.770414
b  0.306820  0.632812
c  0.075267  0.788072

In [150]:
#indexing/ slicing/ fancy indexing

data =pd.Series([0.25,0.5,0.75,1.0],
                index = ['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [151]:
data['b']

0.5

In [152]:
data[-1] #implicit index ok --> because index as str

1.0

In [153]:
#add data
data ['e'] = 99
data

a     0.25
b     0.50
c     0.75
d     1.00
e    99.00
dtype: float64

In [154]:
# data[1234568765432] = 'Chaky' ### Does not work because type of index is string not int
# but adta['1234568765432'] -> ok

In [155]:
#in  ==> keys
'a' in data

True

In [156]:
#print keys
data.keys() #indexing sliing --> type =object

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [157]:
#what if i want the values
#data.items()
data.items()

In [158]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0), ('e', 99.0)]

In [159]:
for k,v in data.items():
    print(k, ' =>' ,v )

a  => 0.25
b  => 0.5
c  => 0.75
d  => 1.0
e  => 99.0

In [160]:
for ix,(k,v) in enumerate(data.items()):
    print(ix,k, ' =>' ,v )

0 a  => 0.25
1 b  => 0.5
2 c  => 0.75
3 d  => 1.0
4 e  => 99.0

In [161]:
data.values #np array

array([ 0.25,  0.5 ,  0.75,  1.  , 99.  ])

In [162]:
data['a':'c'] #explicit index #include stop

a    0.25
b    0.50
c    0.75
dtype: float64

In [163]:
data[0:2] #inplicit index #exclude stop

a    0.25
b    0.50
dtype: float64

In [164]:
#masking 
# data[data>0.3 & data<0.8] does not work 
data[(data>0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [165]:
#fancy indexing
data[['a','e']]

a     0.25
e    99.00
dtype: float64

In [166]:
data['e'] #i will NOT be able to do this in DataFrame because it is COLUMN IN DATAFRAME!!!!!!!! but series its ok!

99.0

In [167]:
data = pd.Series(['a','b','c'], index=(1,3,5))
data

1    a
3    b
5    c
dtype: object

In [168]:
data[1:3] # will not include 3

3    b
5    c
dtype: object

In [169]:
### HIGHLY recommended to decrease the confusion
# data.iloc #implicit!
# data.loc #explicit!

In [170]:
data.iloc[1:3] #implicit will not include the stop parameter

3    b
5    c
dtype: object

In [171]:
data.loc[1:3] # include the stop parameter

1    a
3    b
dtype: object

In [172]:
#DataFrame
pop_dict

{'Chiangrai': 111, 'Pathum Thani': 222, 'Bangkok': 333, 'Chiangmai': 444}

In [173]:

area_dict = {'Chiangrai':2,
           'Pathum Thani': 3,
           'Bangkok':4,
           'Chiangmai':5,
            'Syria':6}
data = pd.DataFrame({'pop':pop_dict,
                     'area':area_dict})

In [174]:
data

                pop  area
Chiangrai     111.0     2
Pathum Thani  222.0     3
Bangkok       333.0     4
Chiangmai     444.0     5
Syria           NaN     6

In [175]:
data.area is data['area']

True

In [176]:
data.pop is data['pop'] #pop is a python native method

False

In [177]:
data['Chiangrai':'Syria'] #slicing -> OK indexing NOK

                pop  area
Chiangrai     111.0     2
Pathum Thani  222.0     3
Bangkok       333.0     4
Chiangmai     444.0     5
Syria           NaN     6

In [178]:
#Pandas if fantastic for feature engineering
#feature engineering is creating new features
#polynomial
#exponentia
#normal interactions between features

data[ 'density']=data['pop']/data['area']

In [179]:
data

                pop  area  density
Chiangrai     111.0     2    55.50
Pathum Thani  222.0     3    74.00
Bangkok       333.0     4    83.25
Chiangmai     444.0     5    88.80
Syria           NaN     6      NaN

In [180]:
# to get the first row! use ILOG
data.iloc[0]

pop        111.0
area         2.0
density     55.5
Name: Chiangrai, dtype: float64

In [181]:
data.iloc[:3,:1]

                pop
Chiangrai     111.0
Pathum Thani  222.0
Bangkok       333.0

In [182]:
data.loc[:'Bangkok',:'pop'] ###LOC => explicit index

                pop
Chiangrai     111.0
Pathum Thani  222.0
Bangkok       333.0

In [183]:
#masking + fancy indexing
data.loc[data.density>60] #give me the rows

                pop  area  density
Pathum Thani  222.0     3    74.00
Bangkok       333.0     4    83.25
Chiangmai     444.0     5    88.80

In [184]:
data.loc[data.density>60,['density','pop']] # fancy indexing only works for columns not rows

              density    pop
Pathum Thani    74.00  222.0
Bangkok         83.25  333.0
Chiangmai       88.80  444.0

In [185]:
#can be combined iloc and loc
data.loc[:'Bangkok'].iloc[:,:2]

                pop  area
Chiangrai     111.0     2
Pathum Thani  222.0     3
Bangkok       333.0     4

In [186]:
#broadcasting
#random generator basically creates a generator
#that is based on some seed (which is 42)
#rng.random (it will always give you the same results)
#you can get reproducable results
rng = np.random.RandomState(42)
# np.random.seed(42) only stays for this cell not for the whole notebook
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                 columns = ['A','B','C','D'])
df

   A  B  C  D
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [187]:
#broadcasting

#broadcasting with a scalar -> number
df_new = np.sin(df*np.pi/4)
df_new

          A             B         C             D
0 -1.000000  7.071068e-01 -0.707107  1.224647e-16
1 -1.000000  7.071068e-01  1.000000 -1.000000e+00
2 -0.707107  1.224647e-16  0.707107 -7.071068e-01

In [188]:
#broacasting concept
#needs to deal with how the index is alingned

area = pd.Series({'Alaska':111,'Texas':222,'Cali':333},name = 'area')
popu = pd.Series({'Cali':999,'Texas':1039,'New York':765},name = 'population')

#how broadcasting work when the index does not work
#why we need to care about the index
#becuase pandas has this concept of this so called "index"

popu/area #outer join

Alaska          NaN
Cali        3.00000
New York        NaN
Texas       4.68018
dtype: float64

In [189]:
A = pd.Series([2,4,6], index = [0,1,2])
B = pd.Series([1,3,5], index = [1,2,3])
A+B # outer join

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [190]:
# if index does not mat, fill with some value
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [191]:
#braodcasting operation between series and dataframe
A = rng.randint(10,size=(3,4))
df = pd.DataFrame(A,columns = list('QRST'))
df

   Q  R  S  T
0  7  2  5  4
1  1  7  5  1
2  4  0  9  5

In [192]:
df.iloc[0]

Q    7
R    2
S    5
T    4
Name: 0, dtype: int64

In [193]:
#df => dataframe ; data.iloc[0] = >Series
#DataFrame - seires=  dataframe
#seires | dataframe
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -6  5  0 -3
2 -3 -2  4  1

In [194]:
df.subtract(df['R'],axis = 0)

   Q  R  S  T
0  5  0  3  2
1 -6  0 -2 -6
2  4  0  9  5

In [195]:
df.subtract(df['R'],axis = 1) # does not make sense

    Q   R   S   T   0   1   2
0 NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN

In [196]:
#creation
#indexing/slicing/fancy indexing/ masking
#broadcasting -> x-x.mean()

#handling missing data
#how pandas represent missing data
#two types ;none and np.nan
#use np.nan -> float value that is ridiculously small, so small that 
#it basicaly doesnt exist
#because wen you use None, nothing can be addedminus

type(np.nan)
#np.nan + = / * = np.nan
np.nan - 1 
np.nan + 1000000000 # so on so on

nan

In [197]:
type(None)

NoneType

In [198]:
import sys
sys.getsizeof(np.nan)

24

In [199]:
sys.getsizeof(None)

16

In [200]:
# None cannot perform any math operation
#None + 1 ---> ERROR Cannot be executed!

In [235]:
vals = np.array([1,np.nan,3,4])
vals.sum()

nan

In [202]:
vals = np.array([1,np.nan,3,4])
# vals.sum()
np.nansum(vals) #nanmin,nanmax,nanmean?????

8.0

In [203]:
#converting None to Float

#1. when your series ahas intefers or float, None will be cast to float

s = pd.Series([1,None,np.nan])
s

0    1.0
1    NaN
2    NaN
dtype: float64

In [204]:
#2. When your series doesnot have int or foat but  string
s = pd.Series(["Chaky",None,np.nan])
s

0    Chaky
1     None
2      NaN
dtype: object

In [205]:
#3. When your series doesnot have int or foat but  boolean
s = pd.Series([True,None,np.nan])
s

0    True
1    None
2     NaN
dtype: object

In [206]:
#THis is HUGE
#how to deal with mising data
#drop whole rows or columns
#replace replace the np.nan with some values


#dropping 
#conservative approach -> simply remove the wole column or rws
# if your column has 50% missing values, just cut that cols.\
#or if your rows has some missing vlaues,cut the row
#you doont intriduce anything
#downside: what if what you cut is important
# replace or collect datas

#replacing
#cheating approach
#replcing with what?
#continues value , replace with mean edian ,random value, regression
#catagorical values - replace "missing", mode, classification result

#WHY I am quite cautious when replacing
#when you replac ewhen some values
#you may change the distribution
#you may change the variance
#PEOPLE can cheat to replace whatever they feel just to get the results they want => integrity


#WHen do i know that i can safely replace
#minor: when you have 1% missing data
#when the distribution is known
#check the type of distribution before and after replcing values!

In [207]:
#1. Dropping
#pandas treat both np.nan and None as missing data
dfs = pd.Series([1,np.nan,"hello",None])
dfs.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [208]:
dfs[dfs.notnull()]

0        1
2    hello
dtype: object

In [209]:
#dropping => dropna => drop not available 
dfs
dfs.dropna() #ITS not INPLACE does not chang the value of the original, therefore we need a return #by defult axis = 0

0        1
2    hello
dtype: object

In [210]:
dfs

0        1
1      NaN
2    hello
3     None
dtype: object

In [211]:
df = pd.DataFrame([
    [1,np.nan,2],
    [2,3,5],
    [np.nan,4,np.nan],
    [4,np.nan, np.nan]
])

In [212]:
df.dropna(axis = 0)

     0    1    2
1  2.0  3.0  5.0

In [213]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [214]:
df[3] = np.nan
df

     0    1    2   3
0  1.0  NaN  2.0 NaN
1  2.0  3.0  5.0 NaN
2  NaN  4.0  NaN NaN
3  4.0  NaN  NaN NaN

In [215]:
df.dropna(axis = 1,how = 'all')

     0    1    2
0  1.0  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  NaN
3  4.0  NaN  NaN

In [216]:
df.dropna(axis = 0,how = 'all')

     0    1    2   3
0  1.0  NaN  2.0 NaN
1  2.0  3.0  5.0 NaN
2  NaN  4.0  NaN NaN
3  4.0  NaN  NaN NaN

In [217]:
#1. Dropping => dropna
#2. replace => fillna
df

     0    1    2   3
0  1.0  NaN  2.0 NaN
1  2.0  3.0  5.0 NaN
2  NaN  4.0  NaN NaN
3  4.0  NaN  NaN NaN

In [218]:
df.fillna(0)

     0    1    2    3
0  1.0  0.0  2.0  0.0
1  2.0  3.0  5.0  0.0
2  0.0  4.0  0.0  0.0
3  4.0  0.0  0.0  0.0

In [219]:
df.fillna(df.mean()) #axis = 0 across samples

          0    1    2   3
0  1.000000  3.5  2.0 NaN
1  2.000000  3.0  5.0 NaN
2  2.333333  4.0  3.5 NaN
3  4.000000  3.5  3.5 NaN

In [220]:
df[1] #always access by col DATAFRAME

0    NaN
1    3.0
2    4.0
3    NaN
Name: 1, dtype: float64

In [221]:
df[1].fillna(df[1].mean(),inplace = True)

In [222]:
df

     0    1    2   3
0  1.0  3.5  2.0 NaN
1  2.0  3.0  5.0 NaN
2  NaN  4.0  NaN NaN
3  4.0  3.5  NaN NaN

In [223]:
#What if i dontwant to replace with mean
print(df)
#use a function called interpolate

df.interpolate(method='linear') #'pad' useful in cnn

     0    1    2   3
0  1.0  3.5  2.0 NaN
1  2.0  3.0  5.0 NaN
2  NaN  4.0  NaN NaN
3  4.0  3.5  NaN NaN

     0    1    2   3
0  1.0  3.5  2.0 NaN
1  2.0  3.0  5.0 NaN
2  3.0  4.0  5.0 NaN
3  4.0  3.5  5.0 NaN

In [224]:
#Handling missing data


#concatenating datasets #Outer join

data_numpy=np.random.rand(3,2)
index = ['Bangkok','Chiangmai']


#inner join then (,join = 'inner')

In [225]:
#merging based on some KEY #inner join
#merging is based on some primary ID
#in which you combine

right =

rght

#merge them base don column ID #inner join!
result = pd.merge(leftmright, on = 'ID')
result 

#if prefer outer join then (,how= 'outer','right','left')

SyntaxError: invalid syntax (<ipython-input-225-b22652e49852>, line 5)

In [226]:
##### Review from last lecture
#2data strucutres
#1.Seires 1feature1 dimension
#2.Dataframe more than one features

#implicite index>> by numbers does not include stop pa
#explicit index 

#iloc
#loc

#create series
#list
#numpy array
#dictionary - key -> index value-> value

#create dataframe
#list of dictionary
#dictionaries
#numpy array - what if dimension is only 1
#pd.DataFrame --> still ok but when you extract that one column it becomes series again.

#handling missing data
#np.nan None
#drop some na -> dropna
#replace some na -> fillna
#drop vs. fill -> drop is much better, but fill only when you know the distribution

#pd.concate
#pd.merge

In [227]:
#Aggregation
#When you pass tuples, they are all VALUES
#here your passing 3 features
import pandas as pd
import numpy as np
df = pd.DataFrame([
    ('bird','Falconiformes',389),
    ('bird','Psittaciformes',24),
    ('mammal','Catlike', 80.2),
    ('mammal','Humanlike',np.nan),
    ('mammal','FastAnimal',58)
],
     index =['falcon','parrot','lion','monkey','leopard'],
     columns =['class','species','speed'])

#index can also be passed in as TUPLE as well as LIST
#if accept TUPLE, will also accept LIST, not necessary AS DICTIONARY
# Tuples perform better, since list can be expanded
#Pivot tables

#Time series data

In [228]:
df.head()

          class         species  speed
falcon     bird   Falconiformes  389.0
parrot     bird  Psittaciformes   24.0
lion     mammal         Catlike   80.2
monkey   mammal       Humanlike    NaN
leopard  mammal      FastAnimal   58.0

In [229]:
#df['falcon'] DOES NOT WORK!
#index access columns for DataFrame

df.iloc[0:2] #will not include the last parameter
df.iloc[0:2,1] #still using iloc
#or
df.iloc[0:2]['species']
df.iloc[0:2].loc[:,'species']

falcon     Falconiformes
parrot    Psittaciformes
Name: species, dtype: object

In [234]:
grouped = df.groupby('class')
type(grouped) # not just dataframe but DAtaframeGroupby
dir(grouped)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_add_numeric_operations',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_multiple_funcs',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_apply_whitelist',
 '_assure_grouper',
 '_bool_agg',
 '_builtin_table',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_blocks',
 '_cython_agg_general',
 '_cython_table',
 '_cython_transform',
 '_define_paths',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cython_func',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_wrapper',
 '_obj_with_exclusions',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform_fast',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_should_cast',
 '_try_aggregate_string_function',
 '_try_cast',
 '_wrap_agged_blocks',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_frame_output',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'class',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sem',
 'shift',
 'size',
 'skew',
 'species',
 'speed',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'var']

In [231]:
#basically, any DataFrameGroupBy object has a lot of utility functions
#aggregations
grouped.sum()

        speed
class
bird    413.0
mammal  138.2

In [232]:
grouped = df.groupby(['class','species']) #without []  it willtake 'species' as axis so it will not work
#this case cannot pass TUPLE IN!!!!!!!!!! because this function accets only lists
grouped.sum()
type(grouped.sum())
#### return as a dataframe

pandas.core.frame.DataFrame

In [233]:
grouped['speed'].median()

type(grouped['speed'].median()) ### because only access only one column -->>>>>>> return as series

pandas.core.series.Series

In [ ]:
#try a real world examples
#example -> planet
import os

os.environ['http_proxy'] = 'http://192.41.170.23:3128'
os.environ['https_proxy'] = 'http://192.41.170.23:3128'
#seaborn is essentially a plotting library
#seaborn is more mordern compared to matplotlib

import seaborn as sns
planets = sns.load_dataset('planets')

In [ ]:
type(planets) #once you know the type you know what you can do with it

In [ ]:
planets.shape

In [ ]:
planets.head()

In [ ]:
planets.index #for loops -> OK

In [ ]:
planets.columns

In [ ]:
#aggregation

planets.mean() #it means across columns only for each feature axis = 0
#median,min,max,std,var,sum,count

In [ ]:
##only describe stuffs that are numiracal
#shows missing values eg orbital missin value - 1035-992
planets.describe()
#no method columns, because methods are not numerical

In [ ]:
planets['mass'].hist()

In [ ]:
planets['mass'].mean()

In [ ]:
#if we were to fill in missing info with 0s
planets['mass'].fillna(0,inplace=True) #std changed and mean changed by too much! not a good idea at all

In [ ]:
planets.describe()

In [ ]:
planets['orbital_period'].hist(bins=100)

In [ ]:
planets['orbital_period'].mean()

In [ ]:
planets['orbital_period'].std()

In [ ]:
m=planets['orbital_period'].mean() ## try .mean .median and check if data changs too muc! on the mean and std
(planets['orbital_period'].fillna(m,inplace= True))

In [ ]:
planets.describe()

In [ ]:
planets['distance'].fillna(planets['distance'].mean(),inplace=True)

In [ ]:
planets.describe()

In [ ]:
planets.groupby('method').sum()

In [ ]:
#groupby but only orbital period
(planets.groupby('method')['orbital_period'].min()).iloc[:2]

In [ ]:
#try to sort, .min and get the first two methods with the lowest min

df=planets.groupby('method').min()

df = df.sort_values(['orbital_period'],ascending = True) # can add more []
df['orbital_period'].iloc[:2]

In [ ]:
#grup by method,sort by myear, distance, give me the last 3 rows
#show me distance and year
#do the explicit index on the first row
df = planets.groupby('method').sum()
df = df.sort_values(['year','distance'],ascending=True) # year, distance => distance will sort distance first then year
# df.iloc[-3:,3:]
df.iloc[-3:,3:].loc['Imaging']

In [ ]:
# for (k,v) in planets.groupby('method'): #imagine this group by object like a dictionary
#     print(f"====Method {k} ====")
#     print(v) #imagine this group by obhect like a dictionary

In [ ]:
#what else you can do with group by object
#1. its like a dictionary
#2. g.aggregate()
#3. g.filter()
#4. g.apply()

#this aggregate takes a list of funcs
#functions can be defined in str or simply func
#you can also write your own aggregate fcuntion
import numpy as np
planets.groupby('method')['orbital_period'].aggregate(['min',np.min, np.median,max,np.mean,np.std,'count'])

In [ ]:
#filter #filter takes function which can be def or lambda
planets.groupby('method').filter(lambda x:x['orbital_period'].std() <3)

In [ ]:
#appply
#pply taes function
#usualy is a def or lambda 
planets.groupby('method').apply(lambda x:x.describe())

In [ ]:
#pivot tabbles
titanic = sns.load_dataset('titanic')
titanic.head()

In [ ]:
titanic.shape 
#actually 14 feature because the table includes the targets already
#our feature is dead or survive
#classification

In [ ]:
#group by sex, colu,m survived mean
titanic.groupby('sex')[['survived']].mean()
# titanic['survived']
#titanic.groupby('sex')['surived'].mean() --> series
#to change to dataframe
#titanic.groupby('sex')[['surived']].mean()

In [ ]:
titanic.groupby(['sex','class'])[['survived']].mean()

In [ ]:
import pandas as pd
age = pd.cut(titanic['age'],[0,10,18,50,100])
age
# np.digitize
#cut based on quatile
#pd.cut
fare=pd.qcut(titanic.fare,2)
fare

In [ ]:
titanic.groupby(['sex','class',age])[['survived']].mean()

In [ ]:
#pivot table(values, index, cols)
titanic.pivot_table('survived',['sex',age],'class') # data frame

In [ ]:
#time series
#padas author creates pandas for financial analysis

from datetime import datetime

In [ ]:
#fundamental data strucuture f date time for python
#time

datetime(year = 2025,month = 7,day = 3)

In [ ]:
from dateutil import parser
date= parser.parse("4th of July,2015")
type(date)
date
#th can e removed , can be removed  # play around with the format
#the zeros at the back are hrs and minutes

In [ ]:
date.strftime('%A') #--> days %W wth and so on
# %b %B different

In [ ]:
date = np.array('2015-07-14',dtype =np.datetime64)

In [ ]:
date
#np.datetime64 is built on top of python date time but more efficient

In [ ]:
#numpy array
#broadcasting 
date+ np.arange(12)

In [ ]:
#pd.to_timedelta
date+pd.to_timedelta(np.arange(12),'D') # M and Y time difference ebtween each month/year are not equal

In [ ]:
#this  kinda stuff really becomes useful when ou aply to pandas

index = pd.to_datetime(['2014-07-04','2015-07-04',
                       '2016-07-04','2017-07-04',])
type(index) #datatimeIndex is basicaly built upon np.datetime64 but for pandas

In [ ]:
index

In [ ]:
value=np.random.rand(4,2)
value

In [ ]:
columns=['A','B']

data = pd.DataFrame(value, index=index,columns=columns)

In [ ]:
data

In [ ]:
data['A']

In [ ]:
data[columns]

In [ ]:
data['2014-07']
data['2014']

In [ ]:
data['2014':'2016'] #datetime Index not the same as inplicit and explocit

In [ ]:
#we alread know that creating dateitme index is so nice
#1. pd.to_datetime([list of dates])
#2.pd_date_range(start,stop,period,freq)

In [ ]:
index = pd.date_range('2015-07-03','2015-07-10')
index

In [ ]:
index = pd.date_range('2015-07-03',periods=8)
index

In [ ]:
index = pd.date_range('2015-07-03',periods = 8,freq='M') #M =months, MS month stop BH = Business hour
index #reset to 31st

In [ ]:
#custiomized 
index = pd.date_range('2015-07-03',periods = 10, freq = '1BMS')
index

In [ ]:
index = pd.date_range('2015-07-03',periods = 10, freq = 'MS')
index

from pandas.tseries.offsets import DateOffset
index +DateOffset(days=2)

In [ ]:
from pandas_datareader import data


goog=data.DataReader('GOOG',start='2004', end='2016', data_source='yahoo')

In [ ]:
goog

In [ ]:
import matplotlib.pyplot as plt
goog_close = goog[['Close']]

#what is type of goog_close
#series

#series or dataframe has a function .plot
#series.plot()
#dataframe.plot() => each feature will be a line

#1 year summary
goog_close.plot(alpha=0.2,style='-')
goog_close.resample('BA').mean().plot(style = 'o-') #bussiness year end average of each year
#resample is very important
goog_close.asfreq('BA').plot(style = '--') #picking the end pointAbsolute value of that year end, lower the details

In [ ]:
#difference between resmaple and asfreq
ts = pd.Series(range(365), index = pd.date_range(start = '20190101',end = '20191231',freq = 'D'))

In [ ]:
ts

In [ ]:
ts.asfreq(freq='Q') #value at the end

In [ ]:
ts.asfreq(freq='Q').mean()

In [ ]:
resample_ts = ts.resample('Q')
type(resample_ts)
resample_ts.groups #only the times your intersted in

In [ ]:
resample_ts.mean()

In [ ]:
#### SHIFT
#shift. -> shift the data
#tshift -> shift the index

fig,ax = plt.subplots(3,sharey=True)
#eg no trading on saturdays and sundays therefore the values are missing on saturdays and sundays.
#how to handle these missing datas
#fill with eg interpolate, or fill with the one infront 
goog_close = goog_close.asfreq('D',method='pad') #D for day, 'pad' to fill the missing values with the one right infronteg fill the prices of saturday and sunday with the price of friday
goog_close.plot(ax=ax[0]) #first graph

#shift the data 900 days - freq(D) from before
#to shift so that we can find the different eg the gain or the loss between today and 900 days ago
goog_close.shift(900).plot(ax=ax[1]) #shift the values

#shift the index 
## eg when yoi subtract the datas from 2008, you will get the price differece## double check if the results are the same
goog_close.tshift(900).plot(ax=ax[2]) #shift the index

In [ ]:
#I want to get a daily differences
#give me a series
# fig,ax = plt.subplots(3,sharey=True)
goog_close = goog_close.asfreq('D',method='pad')
yesterday = goog_close.shift(1)
today = goog_close
today - yesterday
# goog_close.plot(ax=ax[0]) 
# #google_close_shift = goog_close.shift(1)
# google_close_shift = goog_close.shift(1).plot(ax=ax[1])
# # google_diff = goog_close - google_close_shift

# diff = google.close

In [ ]:
# do a moving average of window size 3 days
# goog_mvavg = goog_close.rolling(window=3).mean()
# goog_mvavg

two_days_ago = goog_close.shift(2)
three_days_ago = goog_close.shift(3)
mov = (yesterday + two_days_ago+three_days_ago)/3

#perform a monthly return on investment
month = goog_close.shift(-30)
now = goog_close
gain = ((now/month)*100)
gain.plot()

In [ ]:
rolling= goog_close.rolling(365,center = True) #moving average of 365 days
data = pd.DataFrame({'input':goog_close,
                    'one_year rolling mean': rolling.mean(),
                    'one_year rolling std': rolling.std()})
data.plot(style = ['-','--',':'])

In [ ]:
yesterday = goog_close.shift(1,fill_value=0)
change = yesterday - goog_close
goog_close['Change']=change
goog_close.head()

In [ ]:
#average of last three days
#.shift(1)+.shift(2)+.shift(3)/3

#ROI 
#return on investment
#100*tshift(-365)/goog_close) # (-365)look into the future

ROI = (goog_close.tshift(-365)/goog_close)['Close'] * 100
ROI

In [ ]:
ROI.plot()

In [ ]:
#read some csv and put it nto a datagrame using.read_csv
#parse_dates will make our value into valie time
#index_col will make Date as our index
data = pd.read_csv('FremontBridge.csv',index_col = 'Date',parse_dates = True)

In [ ]:
data.head()

In [ ]:
#there is no long this attribute called Date therfore using type it doesnt work
# type(data.Date) #DateTimeIndex
#it is now Index
# therefore we have to use .index
#DateTime index is built apon numpy therefore to retrieve this, we can use [:5]
data.index[:5]

In [ ]:
data['2013-03':'2012-03'] #the data was given in the reverse order

In [ ]:
#is .column is built upon numpy array there fore we can do for loop and also slicng
data.columns

In [ ]:
data.columns = ['West','East']
data.head()

In [ ]:
# #.rename
# data.rename(columns={'West':'Something'})

In [ ]:
#check any missing values
data.isna() #give a table with T and F

In [ ]:
#how many na?
data.isna().sum()

In [ ]:
#fillna with 0 
data.fillna(0,inplace = True)

#feature engineering
#creating new features related to(based on) the existing features
#that could b meaningful for the prediction
#polynomial.,exponentialfeature interaction

In [ ]:
#create new column
#(east + west)^2
# data['Total'] = (data['West'] + data['East'])**2
# data.head()
data['Total'] = (data['West'] + data['East'])
data.head()

In [ ]:
# weekly average
# hint:dont use asfreq
byweek = data.resample('W').mean()
byweek.head()

In [ ]:
byweek.plot(style=[":","--",".-"])
plt.ylabel('Weekly bicycle count')

In [ ]:
#number of rides on each period of time
#12 O'clock how many people ride , 1 O'clock 2....

###### data.index.time###### important
data.index.time #group by
data_by_hr = data.groupby(data.index.time).mean().plot()
print(data_by_hr)

###### data.index.datofweek###### important
#number of tides from Monday to Sundays
data_by_week = data.groupby(data.index.dayofweek).mean().plot()
print(data_by_week)

# dayofweek = data.groupby(data.index.dayofweek).mean()
# dayofweek.index = ['Mon','Tues','Weds','Thurs','Fri','Sat','Sun']

# dayofweek